EDT/УТ/src/Documents/oz_ПриёмПосылок/oz_ПриёмПосылок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>oz_ПриёмПосылок</name>
  <attributes>
    <name>КомментарийКПеревозке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихкодПеревозки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакПоврежденияПеревозки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагрузкаСТСД</name>
    <type>
      <types>DocumentRef.ЗагрузкаСТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизведенЭкспортДанных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактическийПриходЗаказовНаСклад</name>
    <type>
      <types>DocumentRef.ФактическийПриходЗаказовНаСклад</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодПосылки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакПоврежденияПосылки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатЭкспорта</name>
      <type>
        <types>CatalogRef.oz_ОтветыOzon</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрогрузилосьВАдминку</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Ожидается</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Поступило</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/Enums/oz_Методы/oz_Методы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>oz_Методы</name>
  <enumValues>
    <name>CarriageReceive</name>
  </enumValues>
  <enumValues>
    <name>PostingReceive</name>
  </enumValues>
  <enumValues>
    <name>PostingGiveoutToCourier</name>
  </enumValues>
  <enumValues>
    <name>PostingReturn</name>
  </enumValues>
  <enumValues>
    <name>PostingGiveout</name>
  </enumValues>
  <enumValues>
    <name>PostingDeliveryDateChange</name>
  </enumValues>
  <enumValues>
    <name>ReturnReasonListGet</name>
  </enumValues>
  <enumValues>
    <name>ArticleReturnedSend</name>
  </enumValues>
  <enumValues>
    <name>ReportGet</name>
  </enumValues>
  <enumValues>
    <name>CarriageListGet</name>
  </enumValues>
  <enumValues>
    <name>CarriageContentGet</name>
  </enumValues>
  <enumValues>
    <name>PlaceInfoListGet</name>
  </enumValues>
  <enumValues>
    <name>ReturnBoxCreate</name>
  </enumValues>
  <enumValues>
    <name>ArticleInfoGet</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Documents/oz_ПриёмПосылок/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПеревозкаПринята = Ложь;
	БылаУспешнаяОтправкаДанных = Ложь;
	
	Если ПроизведенЭкспортДанных Тогда
	    Отказ = Истина;
	    Возврат;
	КонецЕсли;  
	
	
    Ответ = oz_РаботаССервисом.CarriageReceive(СокрЛП(ШтрихкодПеревозки), ПризнакПоврежденияПеревозки, КомментарийКПеревозке, Ссылка);
    
	Если Ответ.Код <> 0 Тогда
		Сообщить("ответ от озона не ОК");
		//Отказ = Истина;
		//Возврат;
	Иначе
		ПеревозкаПринята = Истина;
	КонецЕсли;
	
	
	Для каждого Стр Из Заказы Цикл
	    Если Стр.Поступило И Стр.Ожидается Тогда
			
			Ответ  = oz_РаботаССервисом.PostingReceive(СокрЛП(ШтрихкодПеревозки), СокрЛП(Стр.ШтрихкодПосылки), Стр.ПризнакПоврежденияПосылки, Стр.Заказ, Ссылка);
	        Стр.РезультатЭкспорта = Справочники.oz_ОтветыOzon.НайтиПоКоду(Ответ.Код);
	        Стр.Комментарий = Справочники.oz_ОтветыOzon.НайтиПоКоду(Ответ.Описание);
			
			Если Ответ.Код = 0 Тогда		
				БылаУспешнаяОтправкаДанных = Истина;
			КонецЕсли;
			
	    КонецЕсли;
	КонецЦикла;
	
	
	Для каждого Стр Из Заказы Цикл
	    Если Стр.Поступило И Стр.Ожидается Тогда
			//Ответ = oz_РаботаССервисом.Service1CLoadPostingItems(СокрЛП(Стр.ШтрихкодПосылки));
			//Если Ответ = 1 Тогда
	            Стр.ПрогрузилосьВАдминку = Истина;
			//Иначе
			//    Стр.ПрогрузилосьВАдминку = Ложь;
			//КонецЕсли;
	    КонецЕсли;
	КонецЦикла;
	
	Если ПеревозкаПринята И БылаУспешнаяОтправкаДанных Тогда	
		ПроизведенЭкспортДанных = Истина;	
	КонецЕсли;

    ЭтотОбъект.Записать();
    
	//ДвиженияРСoz_ЭкземплярыТоваровЗаказов();

КонецПроцедуры

Функция CarriageContentGet(Штрихкод, PageNumber = 1, PageSize = 20) Экспорт

    Если Константы.ТестовыйРежимOZONE.Получить() Тогда
        Прокси =  WSСсылки.OZON_test.СоздатьWSПрокси("http://api.ocourier.ru/subagent/carriage","CarriageService","BasicHttpBinding_ICarriageService");
        Логин = "SapiUserTestStrizh";
        Пароль = "SapiUserTestStrizh";
		//ContractID = "5905833597000";
		//ContractID = "6503573280000";
		//ContractID = "6748674605000";
		//ContractID = "6848574561000";
		ContractID = Константы.oz_КлючДоступа.Получить().Код;
    Иначе
        Прокси =  WSСсылки.OZON.СоздатьWSПрокси("ozon/api/subagent","CarriageService","BasicHttpBinding_ICarriageService");
        Логин = "SapiUserStrizh";
        Пароль = "ebie6fi4";
        ContractID = Константы.oz_КлючДоступа.Получить().Код;
    КонецЕсли;
    
    
    Фабрика = Прокси.ФабрикаXDTO;    
    
    Тип_request = Фабрика.Пакеты.Получить("ozon/api/subagent").Получить("RequestCarriageContentGet");
    request = Фабрика.Создать(Тип_request);
    
    request.Login = Логин;
    request.Password = Пароль;
    request.PageSize = PageSize; 
    request.PageNumber = PageNumber;
    request.ContractID = ContractID;
    request.CarriageBarcode = Штрихкод; 
    
    Результат = Прокси.CarriageContentGet(request);
	
	// вывод в строку XML	
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку(); 
	Фабрика.ЗаписатьXML(Запись, request);
	ДанныеXML = Запись.Закрыть();

	
	// вывод в строку XML	
	Запись_request = Новый ЗаписьXML;
	Запись_request.УстановитьСтроку(); 
	Фабрика.ЗаписатьXML(Запись_request, Результат);
	ДанныеXML_request = Запись_request.Закрыть();

    
    РезультатСтруктура = Новый Структура;
    РезультатСтруктура.Вставить("Код", Результат.ResultCode);
    РезультатСтруктура.Вставить("Описание", Результат.ResultMessage);
	РезультатСтруктура.Вставить("Rows", Результат.Rows);
    РезультатСтруктура.Вставить("СписокОтправлений",Результат.PostingInfoList.PostingInfo);
	
	oz_РаботаССервисом.ЗаписатьЛог_oz_ИсторияОтправкиЗапросов(РезультатСтруктура, Перечисления.oz_Методы.ПустаяСсылка(), , Ссылка, ДанныеXML, ДанныеXML_request);
	
    Возврат РезультатСтруктура;

КонецФункции // CarriageContentGet()


Функция ДвиженияРСoz_ЭкземплярыТоваровЗаказов()
    
	//Для каждого Стр Из Заказы Цикл
	//    Если ЗначениеЗаполнено(Стр.Заказ) Тогда
	//        Таблица = smv.СформироватьТаблицуЗначенийИзДанныхSQL("EXEC p1c_getOzonPostingItems "+СокрЛП(Стр.Заказ.Номер));    
	//        Если Таблица.Количество()>0 Тогда
	//            Строка = Таблица[0];
	//            Заказ = Стр.Заказ;
	//            Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",Строка.code);
	//            Штрихкод = Строка.barcode;
	//            
	//            НаборЗаписей = РегистрыСведений.oz_ЭкземплярыТоваровЗаказов.СоздатьНаборЗаписей();
	//            НаборЗаписей.Отбор.Заказ.Установить(Заказ);
	//            НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);
	//            НаборЗаписей.Отбор.Штрихкод.Установить(Штрихкод);
	//            Запись = НаборЗаписей.Добавить();
	//            Запись.Заказ = Заказ;
	//            Запись.Номенклатура = Номенклатура;
	//            Запись.Штрихкод = Штрихкод;
	//            НаборЗаписей.Записать();
	//            
	//        КонецЕсли;
	//    КонецЕсли;
	//КонецЦикла;
	

КонецФункции // ДвиженияРС()
